#read_verilog ../verilog/unisims
# blockbox versions
read_verilog ../verilog/unisims_synth

read_verilog -I../verilog/trilib ../verilog/trilib/*
read_verilog -I../verilog/trilib ../verilog/work/*

proc          
opt 

opt_clean
opt_expr
opt_reduce     
opt_merge
memory
memory_libmap  
techmap 
clean
opt_clean    
setundef -zero 
opt          

abc -liberty
clean
opt_clean
write_verilog -noattr netlist.v